Piorkos/tinyML-performance/house-price-prediction/cortex-m4-64/cortex-m4-64.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32WB
VP_STMicroelectronics.X-CUBE-AI_VS_ArtificialOoIntelligenceJjXAaCUBEAaAI_6.0.0.Signal=STMicroelectronics.X-CUBE-AI_VS_ArtificialOoIntelligenceJjXAaCUBEAaAI_6.0.0
PB7.GPIO_PuPd=GPIO_PULLUP
ProjectManager.MainLocation=Core/Src
PCC.Ble.Mode=NOT_SELECTED
VP_STMicroelectronics.X-CUBE-AI_VS_ArtificialOoIntelligenceJjXAaCUBEAaAI_6.0.0.Mode=ArtificialOoIntelligenceJjXAaCUBEAaAI
RCC.PLLQoutputFreq_Value=64000000
RCC.USART1Freq_Value=64000000
ProjectManager.ProjectFileName=cortex-m4-64.ioc
RCC.SMPSFreq_Value=4000000
RCC.SAI1Freq_Value=16000000
RCC.CortexFreq_Value=64000000
STMicroelectronics.X-CUBE-AI.6.0.0.MaximumSizeOfInputLayer=AI_NETWORK_IN_1_SIZE_BYTES
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32WB55RGVx
Mcu.PinsNb=9
ProjectManager.NoMain=false
RCC.RFWKPFreq_Value=244.140625
RCC.HCLK3Freq_Value=64000000
RCC.PLLSAI1RoutputFreq_Value=16000000
PB6.GPIO_PuPd=GPIO_PULLUP
STMicroelectronics.X-CUBE-AI.6.0.0.MaximumSizeOfOutputLayer=AI_NETWORK_OUT_1_SIZE_BYTES
ProjectManager.functionlistsort=1-SystemClock_Config-RCC-false-HAL-false
STMicroelectronics.X-CUBE-AI.6.0.0.ModelName-3a66c77311f315db68cc8f645ce51b4df0c508670da4a2555b727c64afc9b9a6=network
ProjectManager.DefaultFWLocation=true
STMicroelectronics.X-CUBE-AI.6.0.0.ModelMacc-3a66c77311f315db68cc8f645ce51b4df0c508670da4a2555b727c64afc9b9a6=6771
VP_TIM16_VS_ClockSourceINT.Mode=Enable_Timer
ProjectManager.DeletePrevious=true
RCC.HCLK2Freq_Value=32000000
STMicroelectronics.X-CUBE-AI.6.0.0.StackSize=0x1000
USART1.IPParameters=VirtualMode-Asynchronous
RCC.AHB2CLKDivider=RCC_SYSCLK_DIV2
PinOutPanel.RotationAngle=0
RCC.FamilyName=M
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
RCC.MCO1PinFreq_Value=64000000
ProjectManager.StackSize=0x1000
STMicroelectronics.X-CUBE-AI.6.0.0.LatestDirectoryUsed-3a66c77311f315db68cc8f645ce51b4df0c508670da4a2555b727c64afc9b9a6=/Users/dominikpiorkowski/Desktop/drive/projekty/ML models/predict house price
STMicroelectronics.X-CUBE-AI.6.0.0.ModelFlashOccupation-3a66c77311f315db68cc8f645ce51b4df0c508670da4a2555b727c64afc9b9a6=26136
RCC.I2C3Freq_Value=64000000
RCC.LPTIM1Freq_Value=64000000
USART1.VirtualMode-Asynchronous=VM_ASYNC
PA13.Signal=SYS_JTMS-SWDIO
STMicroelectronics.X-CUBE-AI.6.0.0.ModelCompression-3a66c77311f315db68cc8f645ce51b4df0c508670da4a2555b727c64afc9b9a6=1
Mcu.IP4=TIM16
RCC.FCLKCortexFreq_Value=64000000
Mcu.IP5=USART1
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.IP2=RCC
Mcu.IP3=SYS
Mcu.IP0=CRC
Mcu.IP1=NVIC
STMicroelectronics.X-CUBE-AI.6.0.0.ModelHashList=3a66c77311f315db68cc8f645ce51b4df0c508670da4a2555b727c64afc9b9a6
Mcu.UserConstants=
STMicroelectronics.X-CUBE-AI.6.0.0.IPParameters=XAaCUBEAaAICcArtificialOoIntelligenceJjCore,HeapSize,StackSize,ModelName-3a66c77311f315db68cc8f645ce51b4df0c508670da4a2555b727c64afc9b9a6,ModelType-3a66c77311f315db68cc8f645ce51b4df0c508670da4a2555b727c64afc9b9a6,ModelKind-3a66c77311f315db68cc8f645ce51b4df0c508670da4a2555b727c64afc9b9a6,ModelHashList,ModelNameList,WorkingBufferStartAddrList,LatestDirectoryUsed-3a66c77311f315db68cc8f645ce51b4df0c508670da4a2555b727c64afc9b9a6,ModelStructureFile-3a66c77311f315db68cc8f645ce51b4df0c508670da4a2555b727c64afc9b9a6,ModelMacc-3a66c77311f315db68cc8f645ce51b4df0c508670da4a2555b727c64afc9b9a6,ModelActualCompression-3a66c77311f315db68cc8f645ce51b4df0c508670da4a2555b727c64afc9b9a6,ModelFlashOccupation-3a66c77311f315db68cc8f645ce51b4df0c508670da4a2555b727c64afc9b9a6,ModelRamOccupation-3a66c77311f315db68cc8f645ce51b4df0c508670da4a2555b727c64afc9b9a6,ModelCompression-3a66c77311f315db68cc8f645ce51b4df0c508670da4a2555b727c64afc9b9a6,ValidationInputFileHistory-3a66c77311f315db68cc8f645ce51b4df0c508670da4a2555b727c64afc9b9a6,ValidationOutputFileHistory-3a66c77311f315db68cc8f645ce51b4df0c508670da4a2555b727c64afc9b9a6,InternalRamActivationBufferMaxSize,ActivationBufferSizeList,MaximumNumberOfInputLayer,MaximumNumberOfOutputLayer,MaximumSizeOfInputLayer,MaximumSizeOfOutputLayer
RCC.VCOSAI1OutputFreq_Value=32000000
ProjectManager.TargetToolchain=STM32CubeIDE
STMicroelectronics.X-CUBE-AI.6.0.0.ValidationInputFileHistory-3a66c77311f315db68cc8f645ce51b4df0c508670da4a2555b727c64afc9b9a6=
STMicroelectronics.X-CUBE-AI.6.0.0.InternalRamActivationBufferMaxSize=AI_NETWORK_DATA_ACTIVATIONS_SIZE
Mcu.ThirdPartyNb=1
VP_CRC_VS_CRC.Signal=CRC_VS_CRC
STMicroelectronics.X-CUBE-AI.6.0.0_SwParameter=XAaCUBEAaAICcArtificialOoIntelligenceJjCore\:true;
STMicroelectronics.X-CUBE-AI.6.0.0.ModelActualCompression-3a66c77311f315db68cc8f645ce51b4df0c508670da4a2555b727c64afc9b9a6=0.0
PB7.GPIOParameters=GPIO_PuPd
RCC.HCLKFreq_Value=64000000
Mcu.IPNb=6
RCC.HCLKRFFreq_Value=16000000
ProjectManager.PreviousToolchain=
RCC.APB2TimFreq_Value=64000000
PCC.Ble.PowerLevel=Min
PB6.Signal=USART1_TX
PB6.Mode=Asynchronous
STMicroelectronics.X-CUBE-AI.6.0.0.WorkingBufferStartAddrList=0xFFFFFFFF
Mcu.Pin6=VP_SYS_VS_Systick
Mcu.Pin7=VP_TIM16_VS_ClockSourceINT
STMicroelectronics.X-CUBE-AI.6.0.0.ModelNameList=network
ProjectManager.RegisterCallBack=
Mcu.Pin8=VP_STMicroelectronics.X-CUBE-AI_VS_ArtificialOoIntelligenceJjXAaCUBEAaAI_6.0.0
STMicroelectronics.X-CUBE-AI.6.0.0.MaximumNumberOfOutputLayer=1
RCC.LSE_VALUE=32768
RCC.AHBFreq_Value=64000000
RCC.PLLSAI1PoutputFreq_Value=16000000
Mcu.Pin0=PA13
Mcu.Pin1=PA14
Mcu.Pin2=PB3
Mcu.Pin3=PB6
Mcu.Pin4=PB7
Mcu.Pin5=VP_CRC_VS_CRC
ProjectManager.ProjectBuild=false
RCC.HSE_VALUE=8000000
STMicroelectronics.X-CUBE-AI.6.0.0.ArtificialOoIntelligenceJjXAaCUBEAaAI_Checked=true
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
RCC.FCLK2Freq_Value=32000000
STMicroelectronics.X-CUBE-AI.6.0.0.ModelKind-3a66c77311f315db68cc8f645ce51b4df0c508670da4a2555b727c64afc9b9a6=KERAS
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PB3.Mode=Trace_Asynchronous_SW
board=custom
RCC.VCOOutputFreq_Value=128000000
RCC.Cortex2Freq_Value=4000000
RCC.Cortex2_Div=SYSTICK_CLKSOURCE_HCLK_DIV8
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
ProjectManager.LastFirmware=true
RCC.SMPS1Freq_Value=8000000
ProjectManager.FirmwarePackage=STM32Cube FW_WB V1.11.1
MxDb.Version=DB.6.0.21
TIM16.Period=10000-1
RCC.APB2Freq_Value=64000000
Mcu.ThirdParty0=STMicroelectronics.X-CUBE-AI.6.0.0
ProjectManager.BackupPrevious=false
MxCube.Version=6.2.1
RCC.VCOInputFreq_Value=4000000
PCC.Ble.DataLength=6
RCC.I2C1Freq_Value=64000000
PA14.Mode=Trace_Asynchronous_SW
STMicroelectronics.X-CUBE-AI.6.0.0.XAaCUBEAaAICcArtificialOoIntelligenceJjCore=true
RCC.RNGFreq_Value=32000
RCC.PLLSAI1QoutputFreq_Value=16000000
File.Version=6
VP_SYS_VS_Systick.Mode=SysTick
PB7.Signal=USART1_RX
VP_TIM16_VS_ClockSourceINT.Signal=TIM16_VS_ClockSourceINT
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
RCC.PLLRCLKFreq_Value=64000000
PB6.Locked=true
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA13.Mode=Trace_Asynchronous_SW
ProjectManager.FreePins=false
RCC.IPParameters=AHB2CLKDivider,AHBFreq_Value,APB1Freq_Value,APB1TimFreq_Value,APB2Freq_Value,APB2TimFreq_Value,APB3Freq_Value,Cortex2Freq_Value,Cortex2_Div,CortexFreq_Value,FCLK2Freq_Value,FCLKCortexFreq_Value,FamilyName,HCLK2Freq_Value,HCLK3Freq_Value,HCLKFreq_Value,HCLKRFFreq_Value,HSE_VALUE,HSI48_VALUE,HSI_VALUE,I2C1Freq_Value,I2C3Freq_Value,LPTIM1Freq_Value,LPTIM2Freq_Value,LPUART1Freq_Value,LSCOPinFreq_Value,LSE_VALUE,LSI_VALUE,MCO1PinFreq_Value,PLLN,PLLPoutputFreq_Value,PLLQoutputFreq_Value,PLLRCLKFreq_Value,PLLSAI1PoutputFreq_Value,PLLSAI1QoutputFreq_Value,PLLSAI1RoutputFreq_Value,PWRFreq_Value,RFWKPFreq_Value,RNGFreq_Value,SAI1Freq_Value,SMPS1Freq_Value,SMPSFreq_Value,SYSCLKFreq_VALUE,SYSCLKSource,USART1Freq_Value,VCOInputFreq_Value,VCOOutputFreq_Value,VCOSAI1OutputFreq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32WB55RGVx
RCC.LPTIM2Freq_Value=64000000
PB6.GPIOParameters=GPIO_PuPd
ProjectManager.HalAssertFull=false
ProjectManager.ProjectName=cortex-m4-64
ProjectManager.UnderRoot=true
RCC.APB3Freq_Value=16000000
ProjectManager.CoupleFile=true
PB3.Signal=SYS_JTDO-SWO
RCC.SYSCLKFreq_VALUE=64000000
Mcu.Package=VFQFPN68
PCC.Ble.ConnectionInterval=1000.0
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
STMicroelectronics.X-CUBE-AI.6.0.0.ModelStructureFile-3a66c77311f315db68cc8f645ce51b4df0c508670da4a2555b727c64afc9b9a6=/Users/dominikpiorkowski/Desktop/drive/projekty/ML models/predict house price/predict_house_price.h5
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.CompilerOptimize=6
ProjectManager.ToolChainLocation=
RCC.LSI_VALUE=32000
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
PB7.Mode=Asynchronous
RCC.LSCOPinFreq_Value=32000
PA14.Signal=SYS_JTCK-SWCLK
STMicroelectronics.X-CUBE-AI.6.0.0.MaximumNumberOfInputLayer=1
ProjectManager.HeapSize=0x200
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
STMicroelectronics.X-CUBE-AI.6.0.0.HeapSize=0x200
ProjectManager.ComputerToolchain=false
RCC.HSI_VALUE=16000000
NVIC.TIM1_UP_TIM16_IRQn=true\:0\:0\:false\:false\:true\:true\:true
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
STMicroelectronics.X-CUBE-AI.6.0.0.ModelRamOccupation-3a66c77311f315db68cc8f645ce51b4df0c508670da4a2555b727c64afc9b9a6=384
RCC.PLLPoutputFreq_Value=64000000
RCC.PLLN=32
TIM16.AutoReloadPreload=TIM_AUTORELOAD_PRELOAD_ENABLE
PB7.Locked=true
RCC.APB1TimFreq_Value=64000000
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
RCC.PWRFreq_Value=64000000
RCC.LPUART1Freq_Value=64000000
STMicroelectronics.X-CUBE-AI.6.0.0.ValidationOutputFileHistory-3a66c77311f315db68cc8f645ce51b4df0c508670da4a2555b727c64afc9b9a6=
TIM16.IPParameters=Prescaler,Period,AutoReloadPreload
TIM16.Prescaler=640-1
RCC.APB1Freq_Value=64000000
VP_CRC_VS_CRC.Mode=CRC_Activate
STMicroelectronics.X-CUBE-AI.6.0.0.ModelType-3a66c77311f315db68cc8f645ce51b4df0c508670da4a2555b727c64afc9b9a6=Saved model
ProjectManager.CustomerFirmwarePackage=
STMicroelectronics.X-CUBE-AI.6.0.0.ActivationBufferSizeList=384
ProjectManager.DeviceId=STM32WB55RGVx
ProjectManager.LibraryCopy=1
RCC.HSI48_VALUE=48000000
isbadioc=false
